|Variable|Definition|Key|
|---|---|---|
|survival|Survival|0 = No, 1 = Yes|
|pclass|Ticket class|1 = 1st, 2 = 2nd, 3 = 3rd|
|gender|gender ||
|Age |Age in years| |
|sibsp |number of siblings / spouses aboard|	|
|parch |number of parents / children aboard| |
|ticket|Ticket number ||
|fare | fare| 	|
|cabin |Cabin number|	|
|embarked|Port of Embarkation|C = Cherbourg, Q = Queenstown, S = Southampton|
|boat | Lifeboat||
|body | Body Identification Number||
|home.dest| Home/destination||

- Read data and describe it
- Find columns with missingdata
- Print shape of dataset
- drop columns with more than 25% missing data
- drop columns having independent values(which do not affect the survival rate).


- check data types of all columns
- convert price to numeric
- find columns still having missing/na values and also count of missing data
- fill na with mean for fare and age column column.
- drop na values for embarked column.
- dump the dataframe to a csv file 'titanic_filtered.csv'.


- for surviced column replace 0 with D and 1 with A
- find the frequency of different values in survived column
- group by gender and survived and see the counts in each category
- find different pclass and no of people in each class

- find top 5 people with highest values of age. Count no of male and females in the top 5
- find max age male and female who survived
- get average age by gender
- get average age by people survived vs not-survived

In [25]:
#Read data and describe it
import pandas as pd
df=pd.read_csv(r'C:\Users\Sumana\Desktop\GitRepo\dsc_weekday_2020_09_24\Assignments\Kajal\Assignment_TITANIC\titanic_dataset.csv')
df.describe()

,Unnamed: 0,pclass,survived,age,sibsp,parch,body
count,1309.000000,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,121.000000
mean,654.000000,2.294882,0.381971,29.881135,0.498854,0.385027,160.809917
std,378.020061,0.837836,0.486055,14.413500,1.041658,0.865560,97.696922
min,0.000000,1.000000,0.000000,0.166700,0.000000,0.000000,1.000000
25%,327.000000,2.000000,0.000000,21.000000,0.000000,0.000000,72.000000
50%,654.000000,3.000000,0.000000,28.000000,0.000000,0.000000,155.000000
75%,981.000000,3.000000,1.000000,39.000000,1.000000,0.000000,256.000000
max,1308.000000,3.000000,1.000000,80.000000,8.000000,9.000000,328.000000

In [2]:
#Find columns with missingdata
df.isna().any()

Unnamed: 0    False
pclass        False
survived      False
name          False
gender        False
age            True
sibsp         False
parch         False
ticket        False
fare           True
cabin          True
embarked       True
boat           True
body           True
home.dest      True
dtype: bool

In [3]:
#Print shape of dataset
print(df.shape)

(1309, 15)

In [6]:
#drop columns with more than 25% missing data
r=df.dropna(thresh=0.75*len(df.values),axis=1)
r.head()

,Unnamed: 0,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,embarked
0,0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,$211.34,S
1,1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,$151.55,S
2,2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,$151.55,S
3,3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,$151.55,S
4,4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,$151.55,S

In [10]:
#drop columns having independent values(which do not affect the survival rate).
df.drop(columns=['Unnamed: 0'],inplace=True)
df.columns

Index(['pclass', 'survived', 'name', 'gender', 'age', 'sibsp', 'parch',
       'ticket', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'],
      dtype='object')

In [13]:
#check data types of all columns
df.dtypes

pclass         int64
survived       int64
name          object
gender        object
age          float64
sibsp          int64
parch          int64
ticket        object
fare          object
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object

In [15]:
#convert price to numeric
df.fare=df.fare.replace(r'\D','',regex=True).astype('float')
df.fare

0       21134.0
1       15155.0
2       15155.0
3       15155.0
4       15155.0
         ...
1304     1445.0
1305     1445.0
1306      723.0
1307      723.0
1308      788.0
Name: fare, Length: 1309, dtype: float64

In [18]:
#find columns still having missing/na values and also count of missing data
df.isna().any()
df.isna().any().count()

14

In [20]:
#fill na with mean for fare and age column column.
df.fillna({'fare':df.fare.mean(),'age':df.age.mean()},inplace=True)
df

,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.000000,0,0,24160,21134.0,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.916700,1,2,113781,15155.0,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.000000,1,2,113781,15155.0,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.000000,1,2,113781,15155.0,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.000000,1,2,113781,15155.0,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.500000,1,0,2665,1445.0,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,29.881135,1,0,2665,1445.0,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.500000,0,0,2656,723.0,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.000000,0,0,2670,723.0,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.000000,0,0,315082,788.0,NaN,S,NaN,NaN,NaN

In [24]:
#drop na values for embarked column.
df.dropna(inplace=True)
df.count()
print(df.shape)

(0, 14)

In [26]:
#dump the dataframe to a csv file 'titanic_filtered.csv'.
df.to_csv(r'C:\Users\Sumana\Desktop\GitRepo\dsc_weekday_2020_09_24\Assignments\Kajal\Assignment_TITANIC\titanic_filtered.csv')

In [18]:
#for survived column replace 0 with D and 1 with A
#df.survived.replace({0:'D',1:'A'},inplace=True)
df['survived'] = df['survived'].replace([0,1],['D','A'])
df['survived']

0       A
1       A
2       D
3       D
4       D
       ..
1304    D
1305    D
1306    D
1307    D
1308    D
Name: survived, Length: 1309, dtype: object

In [8]:
#find the frequency of different values in survived column
df.survived.value_counts()

0    809
1    500
Name: survived, dtype: int64

In [6]:
#group by gender and survived and see the counts in each category

grp=df.groupby(["survived","gender"])
print(grp.size())

survived  gender
0         female    127
          male      682
1         female    339
          male      161
dtype: int64

In [21]:
#find different pclass and no of people in each class

grp=df.groupby(["pclass"])
print(grp.size())

pclass
1    323
2    277
3    709
dtype: int64

In [23]:
#find top 5 people with highest values of age. Count no of male and females in the top 5

top5_age=df.sort_values('age',ascending=False).head(5)
print(top5_age)
top5_age_grp=top5_age.groupby('gender')
print(top5_age_grp.size())

      Unnamed: 0  pclass survived  \
14            14       1        A
61            61       1        A
1235        1235       3        D
135          135       1        D
9              9       1        D

                                                   name  gender   age  sibsp  \
14                 Barkworth, Mr. Algernon Henry Wilson    male  80.0      0
61    Cavendish, Mrs. Tyrell William (Julia Florence...  female  76.0      1
1235                                Svensson, Mr. Johan    male  74.0      0
135                           Goldschmidt, Mr. George B    male  71.0      0
9                               Artagaveytia, Mr. Ramon    male  71.0      0

      parch    ticket     fare cabin embarked boat  body  \
14        0     27042  $30.00    A23        S    B   NaN
61        0     19877  $78.85    C46        S    6   NaN
1235      0    347060   $7.78    NaN        S  NaN   NaN
135       0  PC 17754  $34.65     A5        C  NaN   NaN
9         0  PC 17609  $49.50    NaN        C  NaN  22.0

                    home.dest
14              Hessle, Yorks
61    Little Onn Hall, Staffs
1235                      NaN
135              New York, NY
9         Montevideo, Uruguay
gender
female    1
male      4
dtype: int64

In [24]:
#find max age male and female who survived

grp=df[df.survived=='A'].groupby(["gender"])
print(grp.age.max())

gender
female    76.0
male      80.0
Name: age, dtype: float64

In [10]:
#get average age by gender
grp=df.groupby(["gender"])
print(grp.age.mean())

gender
female    28.687071
male      30.585233
Name: age, dtype: float64

In [11]:
#get average age by people survived vs not-survived
print(df.groupby(["survived"]).age.mean())

survived
0    30.545369
1    28.918228
Name: age, dtype: float64